CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Source/gd32l23x_lpuart.c
/*!
    \file    gd32l23x_lpuart.c
    \brief   LPUART driver

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32l23x_lpuart.h"

/*!
    \brief      reset LPUART
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_deinit(void)
{
    rcu_periph_reset_enable(RCU_LPUARTRST);
    rcu_periph_reset_disable(RCU_LPUARTRST);
}

/*!
    \brief      configure LPUART baud rate value
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void lpuart_baudrate_set(uint32_t baudval)
{
    uint32_t lpuclk = 0U, lpudiv = 0U;
    lpuclk = rcu_clock_freq_get(CK_LPUART);

    lpudiv = (lpuclk / 100U * 256U + baudval / 200U) / (baudval / 100U);

    LPUART_BAUD = (LPUART_BAUD_BRR & lpudiv);
}

/*!
    \brief      configure LPUART parity
    \param[in]  paritycfg: LPUART parity configure
                only one parameter can be selected which is shown as below:
      \arg        LPUART_PM_NONE: no parity
      \arg        LPUART_PM_ODD: odd parity
      \arg        LPUART_PM_EVEN: even parity
    \param[out] none
    \retval     none
*/
void lpuart_parity_config(uint32_t paritycfg)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* clear LPUART_CTL0 PM,PCEN bits */
    LPUART_CTL0 &= ~(LPUART_CTL0_PM | LPUART_CTL0_PCEN);
    /* configure LPUART parity mode */
    LPUART_CTL0 |= paritycfg;
}

/*!
    \brief      configure LPUART word length
    \param[in]  wlen: LPUART word length configure
                only one parameter can be selected which is shown as below:
      \arg        LPUART_WL_7BIT: 7 bits
      \arg        LPUART_WL_8BIT: 8 bits
      \arg        LPUART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void lpuart_word_length_set(uint32_t wlen)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* clear LPUART_CTL0 WL bit */
    LPUART_CTL0 &= ~(LPUART_CTL0_WL0 | LPUART_CTL0_WL1);
    /* configure LPUART word length */
    LPUART_CTL0 |= wlen;
}

/*!
    \brief      configure LPUART stop bit length
    \param[in]  stblen: LPUART stop bit configure
                only one parameter can be selected which is shown as below:
      \arg        LPUART_STB_1BIT: 1 bit
      \arg        LPUART_STB_2BIT: 2 bits
    \param[out] none
    \retval     none
*/
void lpuart_stop_bit_set(uint32_t stblen)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* clear LPUART_CTL1 STB bits */
    LPUART_CTL1 &= ~LPUART_CTL1_STB;
    LPUART_CTL1 |= stblen;
}

/*!
    \brief      enable LPUART
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_enable(void)
{
    LPUART_CTL0 |= LPUART_CTL0_UEN;
}

/*!
    \brief      disable LPUART
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_disable(void)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
}

/*!
    \brief      configure LPUART transmitter
    \param[in]  txconfig: enable or disable LPUART transmitter
                only one parameter can be selected which is shown as below:
      \arg        LPUART_TRANSMIT_ENABLE: enable LPUART transmission
      \arg        LPUART_TRANSMIT_DISABLE: enable LPUART transmission
    \param[out] none
    \retval     none
*/
void lpuart_transmit_config(uint32_t txconfig)
{
    LPUART_CTL0 &= ~LPUART_CTL0_TEN;
    /* configure transfer mode */
    LPUART_CTL0 |= txconfig;
}

/*!
    \brief      configure LPUART receiver
    \param[in]  rxconfig: enable or disable LPUART receiver
                only one parameter can be selected which is shown as below:
      \arg        LPUART_RECEIVE_ENABLE: enable LPUART reception
      \arg        LPUART_RECEIVE_DISABLE: disable LPUART reception
    \param[out] none
    \retval     none
*/
void lpuart_receive_config(uint32_t rxconfig)
{
    LPUART_CTL0 &= ~LPUART_CTL0_REN;
    /* configure receiver mode */
    LPUART_CTL0 |= rxconfig;
}

/*!
    \brief      data is transmitted/received with the LSB/MSB first
    \param[in]  msbf: LSB/MSB
                only one parameter can be selected which is shown as below:
      \arg        LPUART_MSBF_LSB: LSB first
      \arg        LPUART_MSBF_MSB: MSB first
    \param[out] none
    \retval     none
*/
void lpuart_data_first_config(uint32_t msbf)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* configure LSB or MSB first */
    LPUART_CTL1 &= ~(LPUART_CTL1_MSBF);
    LPUART_CTL1 |= (LPUART_CTL1_MSBF & msbf);
}

/*!
    \brief      configure LPUART inverted
    \param[in]  invertpara: refer to lpuart_invert_enum
                only one parameter can be selected which is shown as below:
      \arg        LPUART_DINV_ENABLE: data bit level inversion
      \arg        LPUART_DINV_DISABLE: data bit level not inversion
      \arg        LPUART_TXPIN_ENABLE: TX pin level inversion
      \arg        LPUART_TXPIN_DISABLE: TX pin level not inversion
      \arg        LPUART_RXPIN_ENABLE: RX pin level inversion
      \arg        LPUART_RXPIN_DISABLE: RX pin level not inversion
      \arg        LPUART_SWAP_ENABLE: swap TX/RX pins
      \arg        LPUART_SWAP_DISABLE: not swap TX/RX pins
    \param[out] none
    \retval     none
*/
void lpuart_invert_config(lpuart_invert_enum invertpara)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* inverted or not the specified signal */
    switch(invertpara) {
    case LPUART_DINV_ENABLE:
        LPUART_CTL1 |= LPUART_CTL1_DINV;
        break;
    case LPUART_DINV_DISABLE:
        LPUART_CTL1 &= ~(LPUART_CTL1_DINV);
        break;
    case LPUART_TXPIN_ENABLE:
        LPUART_CTL1 |= LPUART_CTL1_TINV;
        break;
    case LPUART_TXPIN_DISABLE:
        LPUART_CTL1 &= ~(LPUART_CTL1_TINV);
        break;
    case LPUART_RXPIN_ENABLE:
        LPUART_CTL1 |= LPUART_CTL1_RINV;
        break;
    case LPUART_RXPIN_DISABLE:
        LPUART_CTL1 &= ~(LPUART_CTL1_RINV);
        break;
    case LPUART_SWAP_ENABLE:
        LPUART_CTL1 |= LPUART_CTL1_STRP;
        break;
    case LPUART_SWAP_DISABLE:
        LPUART_CTL1 &= ~(LPUART_CTL1_STRP);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the LPUART overrun function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_overrun_enable(void)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* enable overrun function */
    LPUART_CTL2 &= ~(LPUART_CTL2_OVRD);
}

/*!
    \brief      disable the LPUART overrun function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_overrun_disable(void)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* disable overrun function */
    LPUART_CTL2 |= LPUART_CTL2_OVRD;
}

/*!
    \brief      LPUART transmit data function
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void lpuart_data_transmit(uint32_t data)
{
    LPUART_TDATA = (LPUART_TDATA_TDATA & data);
}

/*!
    \brief      LPUART receive data function
    \param[in]  none
    \param[out] none
    \retval     data of received
*/
uint16_t lpuart_data_receive(void)
{
    return (uint16_t)(GET_BITS(LPUART_RDATA, 0U, 8U));
}

/*!
    \brief      enable LPUART command
    \param[in]  cmdtype: command type
                only one parameter can be selected which is shown as below:
      \arg        LPUART_CMD_MMCMD: mute mode command
      \arg        LPUART_CMD_RXFCMD: receive data flush command
    \param[out] none
    \retval     none
*/
void lpuart_command_enable(uint32_t cmdtype)
{
    LPUART_CMD |= (cmdtype);
}

/*!
    \brief      configure address of the LPUART
    \param[in]  addr: 0x00-0xFF, address of LPUART terminal
    \param[out] none
    \retval     none
*/
void lpuart_address_config(uint8_t addr)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL1 &= ~(LPUART_CTL1_ADDR);
    LPUART_CTL1 |= (LPUART_CTL1_ADDR & (((uint32_t)addr) << 24U));
}

/*!
    \brief      configure address detection mode
    \param[in]  addmod: address detection mode
                only one parameter can be selected which is shown as below:
      \arg        LPUART_ADDM_4BIT: 4 bits
      \arg        LPUART_ADDM_FULLBIT: full bits
    \param[out] none
    \retval     none
*/
void lpuart_address_detection_mode_config(uint32_t addmod)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

