CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Source/gd32l23x_lpuart.c
    LPUART_CTL1 &= ~(LPUART_CTL1_ADDM);
    LPUART_CTL1 |= LPUART_CTL1_ADDM & (addmod);
}

/*!
    \brief      enable mute mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_mute_mode_enable(void)
{
    LPUART_CTL0 |= LPUART_CTL0_MEN;
}

/*!
    \brief      disable mute mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_mute_mode_disable(void)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_MEN);
}

/*!
    \brief      configure wakeup method in mute mode
    \param[in]  wmethod: two methods be used to enter or exit the mute mode
                only one parameter can be selected which is shown as below:
      \arg        LPUART_WM_IDLE: idle line
      \arg        LPUART_WM_ADDR: address mark
    \param[out] none
    \retval     none
*/
void lpuart_mute_mode_wakeup_config(uint32_t wmethod)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL0 &= ~(LPUART_CTL0_WM);
    LPUART_CTL0 |= wmethod;
}

/*!
    \brief      enable half-duplex mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_halfduplex_enable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 |= LPUART_CTL2_HDEN;
}

/*!
    \brief      disable half-duplex mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_halfduplex_disable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 &= ~(LPUART_CTL2_HDEN);
}

/*!
    \brief      configure hardware flow control RTS
    \param[in]  rtsconfig: enable or disable RTS
                only one parameter can be selected which is shown as below:
      \arg        LPUART_RTS_ENABLE:  enable RTS
      \arg        LPUART_RTS_DISABLE: disable RTS
    \param[out] none
    \retval     none
*/
void lpuart_hardware_flow_rts_config(uint32_t rtsconfig)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 &= ~(LPUART_CTL2_RTSEN);
    LPUART_CTL2 |= rtsconfig;
}

/*!
    \brief      configure hardware flow control CTS
    \param[in]  ctsconfig:  enable or disable CTS
                only one parameter can be selected which is shown as below:
      \arg        LPUART_CTS_ENABLE:  enable CTS
      \arg        LPUART_CTS_DISABLE: disable CTS
    \param[out] none
    \retval     none
*/
void lpuart_hardware_flow_cts_config(uint32_t ctsconfig)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 &= ~LPUART_CTL2_CTSEN;
    LPUART_CTL2 |= ctsconfig;
}

/*!
    \brief      configure hardware flow control coherence mode
    \param[in]  hcm:
                only one parameter can be selected which is shown as below:
      \arg        LPUART_HCM_NONE: nRTS signal equals to the RBNE status register
      \arg        LPUART_HCM_EN:   nRTS signal is set when the last data bit has been sampled
    \param[out] none
    \retval     none
*/
void lpuart_hardware_flow_coherence_config(uint32_t hcm)
{
    LPUART_CHC &= ~(LPUART_CHC_HCM);
    LPUART_CHC |= (LPUART_CHC_HCM & hcm);
}

/*!
    \brief      enable RS485 driver
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_rs485_driver_enable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 |= LPUART_CTL2_DEM;
}

/*!
    \brief      disable RS485 driver
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_rs485_driver_disable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 &= ~(LPUART_CTL2_DEM);
}

/*!
    \brief      configure driver enable assertion time
    \param[in]  deatime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void lpuart_driver_assertime_config(uint32_t deatime)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL0 &= ~(LPUART_CTL0_DEA);
    LPUART_CTL0 |= (LPUART_CTL0_DEA & ((deatime) << 21U));
}

/*!
    \brief      configure driver enable de-assertion time
    \param[in]  dedtime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void lpuart_driver_deassertime_config(uint32_t dedtime)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL0 &= ~(LPUART_CTL0_DED);
    LPUART_CTL0 |= (LPUART_CTL0_DED & ((dedtime) << 16U));
}

/*!
    \brief      configure driver enable polarity mode
    \param[in]  dep: DE signal
                only one parameter can be selected which is shown as below:
      \arg        LPUART_DEP_HIGH: DE signal is active high
      \arg        LPUART_DEP_LOW: DE signal is active low
    \param[out] none
    \retval     none
*/
void lpuart_depolarity_config(uint32_t dep)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* reset DEP bit */
    LPUART_CTL2 &= ~(LPUART_CTL2_DEP);
    LPUART_CTL2 |= (LPUART_CTL2_DEP & dep);
}

/*!
    \brief      configure LPUART DMA for reception
    \param[in]  dmacmd: enable or disable DMA for reception
                only one parameter can be selected which is shown as below:
      \arg        LPUART_DENR_ENABLE: DMA enable for reception
      \arg        LPUART_DENR_DISABLE: DMA disable for reception
    \param[out] none
    \retval     none
*/
void lpuart_dma_receive_config(uint32_t dmacmd)
{
    LPUART_CTL2 &= ~LPUART_CTL2_DENR;
    /* configure DMA reception */
    LPUART_CTL2 |= dmacmd;
}

/*!
    \brief      configure LPUART DMA for transmission
    \param[in]  dmacmd: enable or disable DMA for transmission
                only one parameter can be selected which is shown as below:
      \arg        LPUART_DENT_ENABLE: DMA enable for transmission
      \arg        LPUART_DENT_DISABLE: DMA disable for transmission
    \param[out] none
    \retval     none
*/
void lpuart_dma_transmit_config(uint32_t dmacmd)
{
    LPUART_CTL2 &= ~LPUART_CTL2_DENT;
    /* configure DMA transmission */
    LPUART_CTL2 |= dmacmd;
}

/*!
    \brief      disable DMA on reception error
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_reception_error_dma_disable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

