CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Source/gd32l23x_lpuart.c
    LPUART_CTL2 |= LPUART_CTL2_DDRE;
}

/*!
    \brief      enable DMA on reception error
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_reception_error_dma_enable(void)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);

    LPUART_CTL2 &= ~(LPUART_CTL2_DDRE);
}

/*!
    \brief      enable LPUART to wakeup the mcu from deep-sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_wakeup_enable(void)
{
    LPUART_CTL0 |= LPUART_CTL0_UESM;
}

/*!
    \brief      disable LPUART to wakeup the mcu from deep-sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lpuart_wakeup_disable(void)
{
    LPUART_CTL0 &= ~(LPUART_CTL0_UESM);
}

/*!
    \brief      configure the LPUART wakeup mode from deep-sleep mode
    \param[in]  wum: wakeup mode
                only one parameter can be selected which is shown as below:
      \arg        LPUART_WUM_ADDR: WUF active on address match
      \arg        LPUART_WUM_STARTB: WUF active on start bit
      \arg        LPUART_WUM_RBNE: WUF active on RBNE
    \param[out] none
    \retval     none
*/
void lpuart_wakeup_mode_config(uint32_t wum)
{
    /* disable LPUART */
    LPUART_CTL0 &= ~(LPUART_CTL0_UEN);
    /* reset WUM bit */
    LPUART_CTL2 &= ~(LPUART_CTL2_WUM);
    LPUART_CTL2 |= LPUART_CTL2_WUM & (wum);
}

/*!
    \brief      get flag in STAT/CHC register
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        LPUART_FLAG_PERR: parity error flag
      \arg        LPUART_FLAG_FERR: frame error flag
      \arg        LPUART_FLAG_NERR: noise error flag
      \arg        LPUART_FLAG_ORERR: overrun error
      \arg        LPUART_FLAG_IDLE: idle line detected flag
      \arg        LPUART_FLAG_RBNE: read data buffer not empty
      \arg        LPUART_FLAG_TC: transmission completed
      \arg        LPUART_FLAG_TBE: transmit data register empty
      \arg        LPUART_FLAG_CTSF: CTS change flag
      \arg        LPUART_FLAG_CTS: CTS level
      \arg        LPUART_FLAG_BSY: busy flag
      \arg        LPUART_FLAG_AM: address match flag
      \arg        LPUART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        LPUART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        LPUART_FLAG_TEA: transmit enable acknowledge flag
      \arg        LPUART_FLAG_REA: receive enable acknowledge flag
      \arg        LPUART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus lpuart_flag_get(lpuart_flag_enum flag)
{
    if(RESET != (LPUART_REG_VAL(LPUART, flag) & BIT(LPUART_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear LPUART status
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        LPUART_FLAG_PERR: parity error flag
      \arg        LPUART_FLAG_FERR: frame error flag
      \arg        LPUART_FLAG_NERR: noise detected flag
      \arg        LPUART_FLAG_ORERR: overrun error flag
      \arg        LPUART_FLAG_IDLE: idle line detected flag
      \arg        LPUART_FLAG_TC: transmission complete flag
      \arg        LPUART_FLAG_CTSF: CTS change flag
      \arg        LPUART_FLAG_AM: address match flag
      \arg        LPUART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        LPUART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void lpuart_flag_clear(lpuart_flag_enum flag)
{
    LPUART_INTC |= BIT(LPUART_BIT_POS(flag));
}

/*!
    \brief      enable LPUART interrupt
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        LPUART_INT_IDLE: idle interrupt
      \arg        LPUART_INT_RBNE: read data buffer not empty interrupt and
                                  overrun error interrupt enable interrupt
      \arg        LPUART_INT_TC: transmission complete interrupt
      \arg        LPUART_INT_TBE: transmit data register empty interrupt
      \arg        LPUART_INT_PERR: parity error interrupt
      \arg        LPUART_INT_AM: address match interrupt
      \arg        LPUART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        LPUART_INT_CTS: CTS interrupt
      \arg        LPUART_INT_WU: wakeup from deep-sleep mode interrupt
    \param[out] none
    \retval     none
*/
void lpuart_interrupt_enable(lpuart_interrupt_enum interrupt)
{
    LPUART_REG_VAL(LPUART, interrupt) |= BIT(LPUART_BIT_POS(interrupt));
}

/*!
    \brief      disable LPUART interrupt
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        LPUART_INT_IDLE: idle interrupt
      \arg        LPUART_INT_RBNE: read data buffer not empty interrupt and
                                  overrun error interrupt enable interrupt
      \arg        LPUART_INT_TC: transmission complete interrupt
      \arg        LPUART_INT_TBE: transmit data register empty interrupt
      \arg        LPUART_INT_PERR: parity error interrupt
      \arg        LPUART_INT_AM: address match interrupt
      \arg        LPUART_INT_LBD: LIN break detection interrupt
      \arg        LPUART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        LPUART_INT_CTS: CTS interrupt
      \arg        LPUART_INT_WU: wakeup from deep-sleep mode interrupt
    \param[out] none
    \retval     none
*/
void lpuart_interrupt_disable(lpuart_interrupt_enum interrupt)
{
    LPUART_REG_VAL(LPUART, interrupt) &= ~BIT(LPUART_BIT_POS(interrupt));
}

/*!
    \brief      get LPUART interrupt and flag status
    \param[in]  int_flag: interrupt and flag type, refer to lpuart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        LPUART_INT_FLAG_AM: address match interrupt and flag
      \arg        LPUART_INT_FLAG_PERR: parity error interrupt and flag
      \arg        LPUART_INT_FLAG_TBE: transmitter buffer empty interrupt and flag
      \arg        LPUART_INT_FLAG_TC: transmission complete interrupt and flag
      \arg        LPUART_INT_FLAG_RBNE: read data buffer not empty interrupt and flag
      \arg        LPUART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        LPUART_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        LPUART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt and flag
      \arg        LPUART_INT_FLAG_CTS: CTS interrupt and flag
      \arg        LPUART_INT_FLAG_ERR_NERR: error interrupt and noise error flag
      \arg        LPUART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        LPUART_INT_FLAG_ERR_FERR: error interrupt and frame error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus lpuart_interrupt_flag_get(lpuart_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (LPUART_REG_VAL(LPUART, int_flag) & BIT(LPUART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (LPUART_REG_VAL2(LPUART, int_flag) & BIT(LPUART_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear LPUART interrupt flag
    \param[in]  int_flag: LPUART interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        LPUART_INT_FLAG_PERR: parity error flag
      \arg        LPUART_INT_FLAG_ERR_FERR: frame error flag
      \arg        LPUART_INT_FLAG_ERR_NERR: noise detected flag
      \arg        LPUART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        LPUART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        LPUART_INT_FLAG_IDLE: idle line detected flag
      \arg        LPUART_INT_FLAG_TC: transmission complete flag
      \arg        LPUART_INT_FLAG_CTS: CTS change flag
      \arg        LPUART_INT_FLAG_AM: address match flag
      \arg        LPUART_INT_FLAG_WU: wakeup from deep-sleep mode flag
    \param[out] none
    \retval     none
*/
void lpuart_interrupt_flag_clear(lpuart_interrupt_flag_enum int_flag)
{
    LPUART_INTC |= BIT(LPUART_BIT_POS2(int_flag));
}
